{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 27], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_input"}, "registered_name": null}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 27], "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": -7, "max_value": 7, "rate": 1.0, "axis": 0}, "registered_name": null}, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 27]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": -7, "max_value": 7, "rate": 1.0, "axis": 0}, "registered_name": null}, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "keras.constraints", "class_name": "MinMaxNorm", "config": {"min_value": -7, "max_value": 7, "rate": 1.0, "axis": 0}, "registered_name": null}, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}}]}, "keras_version": "2.15.0", "backend": "tensorflow", "weights": [[[0.20383690297603607, 0.181687593460083, 0.34697091579437256, -0.22388187050819397, 0.014176443219184875, 0.21147194504737854, 0.1311851143836975, -0.07180612534284592, -0.05006032809615135, -0.23578906059265137, -0.3144601583480835, 0.527779757976532, 0.13603417575359344, 0.23164021968841553, 0.5913315415382385, 0.24288903176784515, 0.05408988893032074, 0.012067021802067757, -0.13276131451129913, 0.4242972135543823, 0.02625449374318123, 0.5805336833000183, -0.06870841979980469, 0.0881318524479866, 0.02970200963318348, -0.10146670043468475, 0.2063797116279602, 0.31170785427093506, 0.020467475056648254, 0.19474661350250244, 0.2750070095062256, 0.5324535369873047], [-0.12679098546504974, -0.2291923314332962, 0.33920684456825256, 0.4304569363594055, -0.2778396010398865, -0.010598027147352695, -0.09529778361320496, 0.20725283026695251, -0.011782442219555378, -0.23719024658203125, -0.1655898094177246, -0.02477266825735569, 0.2587345242500305, 0.2775557339191437, -0.02256910689175129, -0.021637018769979477, -0.025721687823534012, 0.3274933397769928, -0.02430390939116478, -0.02795185148715973, -0.028372861444950104, -0.026746580377221107, -0.16438715159893036, 0.0173217561095953, -0.013309394009411335, -0.09924903512001038, -0.22487348318099976, -0.012875095009803772, -0.06672680377960205, -0.024129433557391167, -0.1905178725719452, 0.10209321975708008], [0.2670474946498871, -0.12626682221889496, 0.880314290523529, -1.310630440711975, 0.06976652145385742, 0.12297559529542923, 0.22940534353256226, 1.1541906595230103, 1.6339619159698486, 0.12614014744758606, -0.027189254760742188, 1.1604790687561035, 1.0369635820388794, 1.2360649108886719, 1.5407203435897827, 1.1231580972671509, 1.4565041065216064, 1.0795847177505493, 1.7469022274017334, 1.1201595067977905, 1.277980089187622, 0.9642114043235779, 0.030576884746551514, 1.220868706703186, 1.2969239950180054, 0.2616347670555115, -0.20331904292106628, -0.30424964427948, -0.127679243683815, 1.2117568254470825, 0.24077129364013672, 1.0437074899673462], [0.14638575911521912, -0.14177072048187256, -0.23161566257476807, 0.3995056450366974, 0.15875455737113953, 0.026445038616657257, -0.15957090258598328, -0.3467070758342743, -1.5298935174942017, 0.2733266353607178, 0.19604706764221191, -0.33033570647239685, -0.12154173105955124, 0.07987450808286667, -0.3436308801174164, 0.025546766817569733, -0.345661997795105, 0.04893721267580986, -0.8262836337089539, -0.45510101318359375, 0.04654453322291374, 0.1344282478094101, -0.17825579643249512, 5.5858010455267504e-05, -0.19069989025592804, -0.11098051071166992, -0.13813523948192596, -0.3106689453125, 0.14644303917884827, -0.13410530984401703, 0.2633732557296753, -0.2931566536426544], [-0.07311487197875977, 0.2750477194786072, 0.17237216234207153, 0.3372788727283478, -0.23094165325164795, -0.3300783932209015, 0.07753002643585205, 0.33791014552116394, -0.9749236702919006, 0.16351372003555298, -0.06453901529312134, 0.2784344553947449, 0.1960141956806183, -0.19797661900520325, 0.21663355827331543, 0.11959477514028549, 0.2549033463001251, -0.20483507215976715, -0.26856571435928345, -0.13082709908485413, 0.12179046124219894, 0.2377437949180603, -0.07954081892967224, 0.10039152950048447, 0.1260923445224762, 0.0011767065152525902, 0.2700861692428589, -0.20564481616020203, -0.15494617819786072, -0.1766190379858017, 0.1447206437587738, 0.18799526989459991], [0.2917768061161041, -0.21367032825946808, 0.33995530009269714, 0.5575295686721802, 0.20079147815704346, -0.18327580392360687, -0.2909793257713318, 0.2700360119342804, -0.7421360015869141, -0.29762524366378784, 0.01231946051120758, 0.054777346551418304, 0.290740966796875, 0.2854260206222534, -0.12522372603416443, 0.2206992208957672, 0.010926255024969578, 0.08883687853813171, -0.46508318185806274, -0.19572654366493225, 0.004585743881762028, 0.22847279906272888, -0.19934824109077454, 0.03687133640050888, -0.07819785177707672, -0.318846732378006, -0.27232301235198975, -0.08523058891296387, 0.24780774116516113, 0.15968142449855804, -0.2703510820865631, -0.040429119020700455], [-0.03750355541706085, -0.2705020010471344, 0.7152544260025024, 0.3103017807006836, 0.2517238259315491, -0.1466868668794632, 0.08387207984924316, 0.5115953087806702, 0.7575349807739258, 0.12452509999275208, -0.2307436615228653, 0.46335551142692566, 0.8169650435447693, 0.5372145175933838, 0.7787091732025146, 0.7564168572425842, 0.43500304222106934, 0.5319752097129822, 0.1978471726179123, 0.7196428179740906, 0.6987782716751099, 0.5526805520057678, -0.015392109751701355, 0.36419934034347534, 0.38264214992523193, -0.20128801465034485, -0.26255306601524353, -0.23189757764339447, -0.16314944624900818, 0.37635937333106995, 0.09081679582595825, 0.7486994862556458], [-0.25736725330352783, 0.25005465745925903, 0.2837774157524109, -0.27678442001342773, 0.1924222707748413, 0.16422851383686066, -0.28888267278671265, 0.3354528546333313, 1.1149102449417114, -0.14465852081775665, 0.29086703062057495, 0.6279611587524414, 0.8469230532646179, 0.5585293769836426, 0.4817374050617218, 0.7705225348472595, 0.7643511295318604, 0.7470058798789978, 0.5196224451065063, 1.0364238023757935, 0.6889554262161255, 0.4590384066104889, 0.2922133207321167, 0.8365349173545837, 0.6460897326469421, 0.07591599225997925, 0.25765514373779297, -0.21761322021484375, 0.03663867712020874, 0.689605712890625, -0.2285773903131485, 0.7162467241287231], [0.06413361430168152, -0.2734103500843048, 0.2546738088130951, 0.18531332910060883, -0.18087543547153473, -0.27474722266197205, 0.10503733158111572, 0.038657378405332565, 1.2337530851364136, 0.138043612241745, 0.30252164602279663, 0.33486589789390564, 0.14402306079864502, 0.13683532178401947, 0.5298119783401489, 0.6272320747375488, 0.36484724283218384, 0.13992244005203247, 0.29063019156455994, 0.4063427150249481, 0.3506486713886261, 0.33522939682006836, -0.13247071206569672, 0.622523307800293, 0.007378203794360161, 0.24712276458740234, 0.00022850721143186092, 0.06371134519577026, 0.3010498285293579, 0.39405491948127747, 0.1374739110469818, 0.5598304271697998], [0.25653213262557983, -0.09068474173545837, 0.38113296031951904, -0.17387054860591888, -0.16352634131908417, 0.08093119412660599, -0.30216124653816223, 0.29828599095344543, 1.1546751260757446, -0.2664932906627655, -0.25526633858680725, 0.7631804347038269, 0.4510006010532379, 0.5317163467407227, 0.4495988190174103, 0.6467600464820862, 0.47963884472846985, 0.27114173769950867, 0.8311300873756409, 0.7793943285942078, 0.8889487981796265, 0.29853713512420654, 0.10569775104522705, 0.3904123902320862, 0.22581155598163605, -0.31620460748672485, -0.1305323839187622, -0.036984771490097046, 0.16773661971092224, 0.8722121715545654, 0.12270265817642212, 0.7364916205406189], [0.1970643848180771, 0.07897895574569702, 0.36472710967063904, 0.051802027970552444, -0.03141838312149048, 0.2038993090391159, 0.29059749841690063, 0.6009312868118286, 0.6735991835594177, -0.05415421724319458, 0.14354172348976135, 0.20083816349506378, 0.3697851896286011, 0.09967267513275146, 0.125430166721344, 0.23256950080394745, 0.5213480591773987, 0.3697000741958618, 0.17554032802581787, 0.583198606967926, 0.5889253616333008, 0.6597468852996826, -0.3154386579990387, 0.28578200936317444, 0.1616206020116806, 0.1896113157272339, -0.26525557041168213, 0.24067413806915283, -0.2136019766330719, 0.5496838092803955, 0.08642753958702087, 0.36897188425064087], [-0.29138699173927307, 0.023300006985664368, 0.6428649425506592, -0.06530201435089111, 0.10713502764701843, -0.08761119097471237, 0.09896111488342285, 0.6455512046813965, 1.1062512397766113, 0.07059139013290405, 0.2398194670677185, 0.7140317559242249, 0.5758862495422363, 0.9113491773605347, 0.5201308727264404, 0.5826112031936646, 0.9893063902854919, 0.473318874835968, 1.2105751037597656, 0.4393738806247711, 0.760692834854126, 0.5242420434951782, -0.11452963948249817, 0.8975154161453247, 0.4778454005718231, 0.0024234186857938766, 0.13091132044792175, -0.05495527386665344, 0.3079429864883423, 1.001137375831604, -0.3176599144935608, 0.739206075668335], [-0.3202696442604065, 0.20757895708084106, 0.42537733912467957, -0.0590544268488884, -0.21168023347854614, -0.11940296739339828, 0.0881238579750061, 0.5089818239212036, 0.9667194485664368, -0.20471921563148499, 0.16210409998893738, 0.40574976801872253, 0.4261983633041382, 0.5973203778266907, 0.7409446239471436, 0.2212265580892563, 0.6723191738128662, 0.5035930871963501, 0.08443403244018555, 0.838542640209198, 0.46918973326683044, 0.7390395998954773, -0.19739098846912384, 0.40541285276412964, 0.390255868434906, -0.31410911679267883, -0.046943217515945435, 0.09202113747596741, -0.05835878849029541, 0.27306273579597473, 0.06927704811096191, 0.30590277910232544], [0.2975023686885834, -0.1855805218219757, 1.3209930658340454, -1.0295149087905884, -0.06818264722824097, 0.21255113184452057, -0.15443989634513855, 1.1573346853256226, 1.6756060123443604, -0.14750999212265015, 0.18640446662902832, 1.4229063987731934, 1.2923189401626587, 1.249423861503601, 1.0173765420913696, 1.200524091720581, 1.3952261209487915, 1.2470424175262451, 1.4551520347595215, 1.5641489028930664, 1.3105915784835815, 1.1774699687957764, 0.021275296807289124, 1.0484819412231445, 1.4765241146087646, 0.30305057764053345, -0.16749688982963562, 0.09355458617210388, -0.0590018630027771, 1.536813497543335, 0.1024262011051178, 1.193455696105957], [-0.23594488203525543, 0.16880303621292114, 1.0638045072555542, -0.9055444598197937, -0.1504278928041458, 0.06637313216924667, 0.21631133556365967, 1.2457937002182007, 1.5008492469787598, 0.20913130044937134, 0.23542433977127075, 1.4691720008850098, 0.8421351909637451, 0.7745077610015869, 1.505223035812378, 1.2638453245162964, 1.572843074798584, 0.987751841545105, 1.2151365280151367, 1.3108786344528198, 1.5794405937194824, 1.1640846729278564, 0.12933969497680664, 0.8012891411781311, 1.1506948471069336, 0.03326418995857239, 0.22745966911315918, 0.10963985323905945, -0.2688635587692261, 1.3225091695785522, 0.004516538232564926, 1.1837514638900757], [-0.2610074579715729, 0.01766391098499298, 1.032821536064148, -0.6285718679428101, -0.16578513383865356, -0.1341407299041748, -0.025841236114501953, 1.118296504020691, 1.7530380487442017, -0.0987018495798111, -0.17697390913963318, 1.2364084720611572, 0.9031378626823425, 1.1704356670379639, 1.0730781555175781, 0.8902905583381653, 1.400186538696289, 0.996301531791687, 1.7365236282348633, 1.4497884511947632, 1.0556617975234985, 0.8841837644577026, 0.18269073963165283, 0.9279826283454895, 1.0334292650222778, 0.03590536117553711, -0.014254465699195862, 0.299302875995636, 0.06488701701164246, 1.0171290636062622, -0.10868743062019348, 0.9335613250732422], [-0.258801132440567, -0.29213109612464905, -0.05557125061750412, 1.143667459487915, 0.2081383466720581, 0.2292727828025818, 0.23528575897216797, -0.28356239199638367, -1.7721120119094849, -0.18257449567317963, -0.23410263657569885, -0.2578875720500946, 0.046253837645053864, -0.5065045356750488, -0.11697481572628021, -0.3238745927810669, -0.690234363079071, -0.23185408115386963, -1.1822509765625, -0.6429194808006287, -0.8688810467720032, -0.21625028550624847, 0.17865204811096191, -0.25029438734054565, -0.828307032585144, -0.25706949830055237, 0.03326478600502014, -0.10211418569087982, -0.08426812291145325, -0.5204331278800964, 0.009872250258922577, -0.3613799512386322], [0.2739337980747223, 0.2753217816352844, -0.5130945444107056, 1.0518255233764648, 0.264367938041687, 0.06833665072917938, 0.16983842849731445, -0.11366943269968033, -1.8888205289840698, 0.12847673892974854, -0.20198272168636322, -0.41185522079467773, -0.6064034700393677, -0.31933489441871643, -0.44265714287757874, -0.29562243819236755, -0.6248395442962646, -0.05572451278567314, -1.3723095655441284, -0.7772279381752014, -0.5713755488395691, -0.3028816878795624, -0.14371073246002197, -0.2045382857322693, -0.5483324527740479, -0.30643388628959656, -0.15867367386817932, -0.274924635887146, 0.1640310287475586, -0.399736613035202, 0.3137441873550415, -0.18994401395320892], [-0.1525866985321045, -0.023116454482078552, 0.48836520314216614, 0.21435481309890747, 0.28398942947387695, 0.24531349539756775, -0.31478646397590637, 0.1614312380552292, -0.05036337673664093, 0.07302993535995483, 0.06327912211418152, 0.4096720218658447, 0.09679825603961945, 0.1947999894618988, 0.18836025893688202, 0.34859660267829895, 0.37178680300712585, -0.07130103558301926, -0.5445392727851868, -0.02355233207345009, 0.24578478932380676, 0.17259573936462402, -0.15417827665805817, 0.49644026160240173, -0.0075747668743133545, 0.15764564275741577, 0.017394766211509705, 0.08827638626098633, -0.16739341616630554, 0.416062593460083, 0.2532973885536194, -0.08924592286348343], [-0.1369691640138626, 0.2636510133743286, 0.932505190372467, -0.9947401285171509, -0.11128653585910797, 0.2241770178079605, 0.28197139501571655, 1.432992696762085, 1.7209892272949219, -0.1044090986251831, 0.08854788541793823, 1.636142373085022, 1.2138592004776, 1.092098593711853, 1.542994737625122, 1.619225025177002, 1.4174156188964844, 1.3948369026184082, 1.632789969444275, 1.5246049165725708, 1.3255195617675781, 1.1690737009048462, -0.26513606309890747, 1.2829405069351196, 1.1765674352645874, 0.07123422622680664, -0.1551205962896347, 0.24986964464187622, 0.24940115213394165, 1.485710859298706, -0.11117972433567047, 1.1304470300674438], [-0.17131029069423676, -0.22123585641384125, 0.349468469619751, 0.5449602603912354, 0.149368554353714, -0.24526041746139526, -0.13447344303131104, -0.19371408224105835, -1.0633803606033325, -0.0021501611918210983, -0.11181305348873138, 0.2485472410917282, 0.32871952652931213, -0.01892103999853134, 0.2839460074901581, 0.053898680955171585, -0.1057458445429802, 0.2454364001750946, -0.40842390060424805, 0.13093551993370056, 0.17663487792015076, 0.10815180093050003, -0.12860354781150818, 0.0984269306063652, -0.06051060929894447, -0.29038459062576294, -0.0989827811717987, -0.2608100473880768, -0.26567748188972473, 0.033381253480911255, -0.10512043535709381, 0.2978321313858032], [0.12791457772254944, 0.11468017101287842, 1.0668514966964722, -1.3307842016220093, -0.12490297853946686, 0.059072453528642654, -0.202693909406662, 0.9573812484741211, 2.0534682273864746, 0.12010923027992249, 0.07376006245613098, 0.996364951133728, 0.7284396886825562, 0.8825861215591431, 1.1059411764144897, 1.2887526750564575, 1.558824062347412, 1.0748475790023804, 1.5728756189346313, 1.2398269176483154, 1.2302007675170898, 1.4013257026672363, -0.1326269507408142, 0.9812120199203491, 1.08770751953125, -0.25201913714408875, 0.17741769552230835, 0.0039697252213954926, 0.19259846210479736, 1.4537007808685303, 0.007567517459392548, 1.1481974124908447], [-0.15482328832149506, 0.30551695823669434, 0.5668426156044006, -0.8557275533676147, 0.018902912735939026, 0.19996139407157898, -0.03164482116699219, 0.7267019748687744, 1.604915738105774, -0.255914568901062, -0.16872677206993103, 0.8214604258537292, 1.1070246696472168, 1.2342623472213745, 1.256920337677002, 1.0159974098205566, 1.5114487409591675, 0.6495187878608704, 1.4044837951660156, 0.9738790988922119, 1.2926748991012573, 0.933150589466095, -0.0921471118927002, 1.1028565168380737, 1.2414838075637817, 0.20753580331802368, 0.25735795497894287, 0.06581771373748779, 0.27434617280960083, 1.3311055898666382, -0.29159271717071533, 1.1035442352294922], [0.26784199476242065, -0.306513249874115, 0.742523729801178, -0.6857672929763794, 0.09644478559494019, 0.08691313117742538, -0.128493532538414, 0.9668388962745667, 1.1600773334503174, -0.009577028453350067, 0.20052176713943481, 1.1889064311981201, 1.0679376125335693, 1.0651676654815674, 0.8668137192726135, 1.0860549211502075, 1.0194004774093628, 1.042245864868164, 0.711534321308136, 1.0471665859222412, 0.9750216603279114, 0.6705876588821411, 0.16069579124450684, 0.7635624408721924, 1.001116394996643, -0.07511720061302185, -0.003194209188222885, 0.16663554310798645, -0.3164916932582855, 0.7642350196838379, -0.12362255156040192, 0.7693806290626526], [0.09876017272472382, 0.2435845136642456, 1.0846543312072754, -1.0753198862075806, -0.02105449140071869, 0.09015985578298569, 0.10106337070465088, 0.8217468857765198, 1.5179213285446167, -0.2397548258304596, -0.11406835913658142, 1.2695575952529907, 1.0052684545516968, 1.1321371793746948, 1.4229317903518677, 1.1996289491653442, 1.292598009109497, 1.1240801811218262, 1.2977328300476074, 1.5045640468597412, 1.1381205320358276, 0.9830554127693176, -0.3052176833152771, 1.1581242084503174, 1.0675691366195679, -0.056833237409591675, 0.17909714579582214, -0.18477147817611694, -0.16894946992397308, 1.311240792274475, 0.21900242567062378, 0.9606904983520508], [-0.1471436768770218, -0.22965124249458313, -0.8011459112167358, 1.1475775241851807, -0.17787981033325195, -0.27471092343330383, 0.08877947926521301, -0.8797070384025574, -1.7738949060440063, 0.19804275035858154, -0.09764759242534637, -0.8442807793617249, -0.5254297256469727, -0.5762298107147217, -1.223010540008545, -1.2645117044448853, -1.3236333131790161, -0.6444672346115112, -1.288698434829712, -0.8990716338157654, -1.0260990858078003, -1.0458682775497437, -0.22137346863746643, -0.981306254863739, -1.4019325971603394, 0.142178475856781, -0.21219897270202637, -0.2999003827571869, 0.17131105065345764, -0.9982712864875793, 0.21419775485992432, -1.0245096683502197], [0.20565935969352722, -0.1956605315208435, 0.6618236303329468, -0.09364444017410278, 0.07621395587921143, 0.27669787406921387, 0.15059417486190796, 0.6156358122825623, 0.1829579919576645, -0.1224091649055481, -0.21273872256278992, 0.287821888923645, 0.15858194231987, 0.7022588849067688, 0.35492268204689026, 0.48570743203163147, 0.5132942795753479, 0.5633653402328491, 0.1584278643131256, 0.49461331963539124, 0.27469128370285034, 0.4773136377334595, -0.2561233639717102, 0.38205280900001526, 0.589762270450592, -0.10479898750782013, -0.29584574699401855, -0.25593921542167664, -0.18576809763908386, 0.6101499795913696, -0.24596716463565826, 0.15824481844902039]], [-0.025437088683247566, 0.0, 0.017240913584828377, 0.530979335308075, 0.0, -0.03189610689878464, 0.0, -0.051806651055812836, -1.1280251741409302, 0.0, 0.0, -0.04352351650595665, 0.01306848507374525, 0.005678155925124884, -0.0481671504676342, -0.03458334878087044, -0.18221630156040192, 0.024676479399204254, -0.6369975805282593, -0.1738741546869278, -0.18067902326583862, -0.03684801608324051, 0.0, -0.030562717467546463, -0.31037458777427673, 0.0, 0.0, 0.0, 0.0, -0.16455738246440887, 0.0, -0.01978037878870964], [[0.06151282787322998, -0.004029500763863325, 3.993861537310295e-05, -0.13513773679733276, 0.2379787266254425, 0.14072354137897491, -0.1887178122997284, -0.04553758725523949, 0.18747767806053162, -0.05479619279503822, 0.010911728255450726, 0.1833716630935669, 0.16778498888015747, -0.08613880723714828, -0.26720359921455383, 0.14911091327667236, -0.206247478723526, 0.042222440242767334, 0.07459937036037445, 0.031326744705438614, 0.11611062288284302, -0.18698714673519135, 0.28127291798591614, 0.19811773300170898, 0.10585697740316391, 0.05442354083061218, -0.17808671295642853, -0.26785165071487427, -0.29565131664276123, 0.007683975156396627, 0.09122330695390701, 0.05389699339866638], [0.0828821063041687, -0.12064212560653687, 0.09955088049173355, -0.012250224128365517, 0.27476707100868225, -0.23944558203220367, -0.0142208868637681, -0.13643987476825714, -0.03372571989893913, -0.24785278737545013, -0.26399141550064087, 0.23420730233192444, 0.07345890998840332, 0.2732163071632385, 0.059255510568618774, -0.12028150260448456, -0.142316073179245, 0.23199155926704407, -0.1547195464372635, -0.1634237915277481, -0.011141382157802582, -0.2729141414165497, -0.2777705490589142, -0.1231812983751297, -0.09255249053239822, -0.09644858539104462, 0.0969337522983551, -0.22548933327198029, -0.1261969804763794, 0.2842606008052826, 0.1442277729511261, 0.11394718289375305], [-0.10757729411125183, -0.08604060858488083, 0.47434377670288086, 0.2158842533826828, 0.14501741528511047, 0.2442571371793747, 0.4304622411727905, -0.021253341808915138, 0.34659719467163086, 0.18460458517074585, 0.3233018219470978, -0.10319514572620392, 0.41866201162338257, -0.1404171586036682, 0.26288262009620667, -0.1541992723941803, 0.15329352021217346, -0.08127698302268982, 0.1379178911447525, 0.052046265453100204, -0.14188453555107117, 0.2965593934059143, -0.23127660155296326, 0.009129962883889675, 0.13501708209514618, -0.19067110121250153, -0.2903347313404083, 0.11141657829284668, 0.03890630230307579, 0.2720373272895813, 0.11791907995939255, -0.037083700299263], [0.21516892313957214, -0.20303666591644287, -0.09446153044700623, -0.2960014045238495, 0.03368943929672241, -0.6134223341941833, -0.2755665183067322, -0.5239603519439697, -0.45022037625312805, -0.1984303742647171, -0.5565828680992126, 0.14271768927574158, -0.36896419525146484, -0.6364808082580566, 0.09274852275848389, 0.04730701446533203, -0.5166620016098022, -0.2834392488002777, -0.545025110244751, -0.3484303653240204, 0.07297974824905396, -0.5033918619155884, -0.04133307561278343, -0.41494280099868774, -0.5644412040710449, -0.15840527415275574, 0.020952880382537842, -0.44711020588874817, 0.4259079694747925, -0.5990791916847229, 0.04988428205251694, 0.24120643734931946], [-0.24207402765750885, 0.11601294577121735, 0.2278897613286972, -0.2922499179840088, -0.08927746117115021, 0.14784963428974152, 0.2750844359397888, -0.2154608815908432, 0.2586548924446106, 0.1391654759645462, 0.13352809846401215, 0.010058484971523285, 0.15634343028068542, 0.1707904189825058, -0.1613955944776535, 0.09376275539398193, 0.22034715116024017, 0.27379581332206726, -0.2065514475107193, 0.30040255188941956, 0.22091588377952576, -0.29019495844841003, 0.0437755286693573, -0.20149539411067963, -0.036667708307504654, 0.1232742965221405, 0.2226702868938446, 0.3005649149417877, -0.22948111593723297, 0.04823051393032074, 0.1880808174610138, 0.1180357038974762], [0.15922200679779053, -0.11063922941684723, -0.15760675072669983, -0.06378066539764404, -0.25814464688301086, 0.03971533104777336, -0.26145368814468384, -0.2397029846906662, 0.06531292200088501, -0.20806998014450073, -0.2059086114168167, 0.20474836230278015, -0.13119223713874817, 0.025394264608621597, -0.1509288251399994, -0.20819005370140076, 0.1781051754951477, -0.09273549914360046, -0.08697456121444702, -0.257191926240921, -0.159366175532341, 0.29551494121551514, -0.31505078077316284, -0.16765683889389038, -0.1369982659816742, -0.18376198410987854, 0.2202547788619995, 0.13925114274024963, 0.23125150799751282, -0.04127616435289383, 0.1264236867427826, -0.22597062587738037], [0.12735751271247864, -0.12047101557254791, -0.10639110952615738, 0.07213909178972244, 0.2603490650653839, -0.05920146405696869, 0.07070157676935196, -0.0062425644136965275, 0.08891179412603378, 0.07249454408884048, -0.07217539101839066, 0.03443068265914917, -0.10825645923614502, -0.20115384459495544, 0.12096580862998962, -0.25620707869529724, -0.15261505544185638, 0.15805867314338684, 0.3007781207561493, -0.2627692222595215, -0.1260860562324524, -0.1616680771112442, -0.18196485936641693, 0.007712583988904953, 0.1932750642299652, -0.007011137902736664, -0.2960301637649536, 0.08823324739933014, 0.1681261956691742, -0.0912880003452301, -0.28249913454055786, -0.1829310953617096], [0.1883927583694458, 0.45735713839530945, 0.13094066083431244, -0.09454528242349625, -0.07629521191120148, -0.05162940174341202, 0.30952927470207214, -0.04589201509952545, 0.2271406352519989, 0.28508079051971436, -0.04294459894299507, -0.2631106376647949, 0.5308088660240173, 0.5076927542686462, 0.03453914076089859, 0.04587423801422119, -3.411253055674024e-05, 0.2779466211795807, 0.1678885668516159, 0.34220972657203674, 0.15295162796974182, 0.02231156826019287, 0.06322196125984192, 0.24976177513599396, 0.145478293299675, -0.09791538119316101, 0.042124729603528976, 0.017016615718603134, 0.2615901827812195, 0.4324108362197876, -0.313257098197937, -0.11454355716705322], [0.07429280877113342, 1.7783522605895996, 1.7806354761123657, 1.3579308986663818, -0.22702549397945404, 1.1168854236602783, 1.6205205917358398, 1.7972686290740967, 1.2460997104644775, 1.4034171104431152, 1.58597731590271, -0.23332995176315308, 1.3230592012405396, 1.1878588199615479, -0.0007332388195209205, -0.21624696254730225, 1.3180922269821167, -0.04094231128692627, 1.2377222776412964, 1.4696314334869385, -0.046019136905670166, 1.2428686618804932, -0.21867060661315918, 1.1645346879959106, 1.75368070602417, -0.23831400275230408, 0.08683699369430542, 1.2791166305541992, -0.6654292345046997, 1.365957260131836, 0.25696617364883423, 0.16655007004737854], [0.2065812051296234, -0.08836422115564346, -0.28366464376449585, 0.13172636926174164, -0.04516443610191345, -0.15401700139045715, -0.03061761148273945, -0.029744738712906837, 0.19472697377204895, 0.1808333545923233, 0.015048965811729431, -0.07482008635997772, -0.24738264083862305, 0.06720597296953201, 0.2718551456928253, 0.24231746792793274, -0.02252162992954254, 0.1336919665336609, 0.2772275507450104, 0.3041183650493622, -0.1106766015291214, 0.30175551772117615, 0.03533551096916199, -0.054055631160736084, -0.28353697061538696, 0.21836039423942566, -0.09542979300022125, -0.2104729861021042, -0.2632704973220825, -0.21365603804588318, 0.14636573195457458, -0.20959830284118652], [-0.20515483617782593, 0.17599435150623322, -0.07177262753248215, 0.042144615203142166, -0.09976361691951752, 0.13601361215114594, -0.2830842137336731, 0.24651090800762177, 0.1929454207420349, -0.23396895825862885, 0.26857221126556396, -0.198879212141037, -0.231056809425354, -0.24708902835845947, -0.10324902832508087, 0.08084401488304138, 0.0671936571598053, -0.16712641716003418, 0.22299964725971222, 0.15118393301963806, -0.16826821863651276, -0.08546818792819977, 0.2107076346874237, 0.07635960727930069, -0.11914780735969543, 0.2172357141971588, -0.24526625871658325, 0.0939500704407692, -0.22513927519321442, -0.008438237011432648, -0.24330809712409973, -0.056505799293518066], [-0.28108468651771545, 0.48195958137512207, 0.5741417407989502, 0.39074233174324036, 0.1031789481639862, 0.6235416531562805, 0.30456945300102234, 0.40573909878730774, 0.7127352356910706, 0.6659179329872131, 0.5485728979110718, -0.23252081871032715, 0.4960891604423523, 0.16933748126029968, 0.23433664441108704, 0.22031047940254211, 0.7054397463798523, 0.22521069645881653, 0.27290797233581543, 0.24300551414489746, -0.30220744013786316, 0.3848695755004883, -0.15578405559062958, 0.6360093951225281, 0.7099438905715942, 0.056641221046447754, 0.2811151444911957, 0.5263586640357971, -0.5872417688369751, 0.5309364795684814, 0.11335369944572449, 0.25958451628685], [-0.1203465461730957, -0.01519183162599802, 0.12905065715312958, 0.26226651668548584, -0.148580864071846, -0.00846394058316946, 0.2951493561267853, 0.2242351770401001, 0.21275921165943146, 0.17938023805618286, 0.4926782250404358, -0.14658956229686737, 0.05779175087809563, 0.38302358984947205, 0.08328073471784592, 0.17832732200622559, 0.3329464793205261, -0.18053019046783447, 0.38174623250961304, 0.49911266565322876, -0.2697756588459015, 0.41469529271125793, 0.13695752620697021, 0.4228868782520294, 0.33750981092453003, 0.19074782729148865, -0.1370726227760315, 0.5309632420539856, 0.2708858251571655, 0.02411622554063797, -0.04542621597647667, -0.2953992784023285], [-0.27529048919677734, 0.4562667906284332, 0.058297909796237946, 0.5084690451622009, 0.10986784100532532, 0.33585020899772644, 0.5440071225166321, 0.3656638264656067, 0.3301865756511688, 0.33550065755844116, 0.5343100428581238, -0.0003474482800811529, 0.43064984679222107, 0.37623560428619385, -0.2700820565223694, -0.1214759349822998, 0.15612970292568207, -0.25153693556785583, 0.1609841138124466, 0.5212277173995972, -0.2824140191078186, 0.1809045374393463, 0.15364420413970947, 0.38525599241256714, 0.3700236678123474, -0.21131980419158936, 0.08314932137727737, 0.503502607345581, 0.1333574801683426, 0.13093627989292145, 0.00651636254042387, -0.22786374390125275], [0.07828614115715027, 0.6134307980537415, 0.24238388240337372, 0.24945738911628723, 0.07644405961036682, 0.4074391722679138, 0.5823543667793274, 0.5485273003578186, 0.5913935303688049, 0.47659340500831604, 0.6319759488105774, -0.15584374964237213, 0.10444362461566925, 0.41078269481658936, -0.19224148988723755, -0.14174896478652954, 0.6490004062652588, -0.19664962589740753, 0.6681939959526062, 0.5774139165878296, -0.26981121301651, 0.46410155296325684, -0.26667991280555725, 0.2735428512096405, 0.6735518574714661, 0.0005730944685637951, -0.30485591292381287, 0.34972280263900757, -0.776747465133667, 0.6183350086212158, 0.2686026990413666, -0.3122912645339966], [0.2708987891674042, 0.5796563625335693, 0.4176216125488281, 0.291985422372818, 0.07176721096038818, 0.2076888382434845, 0.4267515540122986, 0.2793407142162323, 0.34775006771087646, 0.33072972297668457, 0.6571705341339111, 0.29945656657218933, 0.29067787528038025, 0.6262883543968201, -0.06292802840471268, -0.16400565207004547, 0.5613240003585815, 0.059810757637023926, 0.33035796880722046, 0.3461247980594635, 0.05561971664428711, 0.3493984639644623, 0.18953275680541992, 0.30822357535362244, 0.6356826424598694, -0.12935063242912292, 0.04200869798660278, 0.15097326040267944, -0.5939174294471741, 0.4684717357158661, -0.17361736297607422, 0.19320352375507355], [0.07419630885124207, 0.32378971576690674, 0.7918375134468079, 0.47888872027397156, -0.24692651629447937, 0.1565425992012024, 0.42237526178359985, 0.45177769660949707, 0.22671110928058624, 0.44426217675209045, 0.4246269166469574, 0.08098039031028748, 0.28551211953163147, 0.5316962003707886, -0.18074055016040802, 0.07494601607322693, 0.2162022739648819, -0.2353895902633667, 0.46689698100090027, 0.673555850982666, 0.1727662980556488, 0.31744298338890076, 0.010001919232308865, 0.18985150754451752, 0.2837314009666443, -0.026577293872833252, -0.044897496700286865, 0.42392465472221375, -0.1891579031944275, 0.7133471965789795, 0.1642778366804123, -0.18785172700881958], [-0.028889566659927368, 0.4644941985607147, 0.08563021570444107, -0.0074222455732524395, -0.09690652787685394, 0.4501892626285553, 0.3464953899383545, 0.4038074314594269, 0.3130583167076111, 0.36297526955604553, 0.09515012055635452, 0.2362913191318512, 0.0064084576442837715, 0.4590858817100525, -0.27750512957572937, -0.08954194188117981, 0.49430978298187256, 0.016503795981407166, 0.29504260420799255, 0.2638128697872162, -0.04313197731971741, 0.14002151787281036, -0.11488205194473267, 0.4027652442455292, 0.451246976852417, 0.11430138349533081, 0.27849096059799194, 0.17225109040737152, 0.2361251711845398, 0.30889827013015747, 0.13582877814769745, 0.04500317573547363], [0.00823500007390976, 0.7259237766265869, 0.9251307249069214, 0.5120750069618225, 0.2366802990436554, 0.7211073040962219, 0.4849340617656708, 1.0195454359054565, 0.6326772570610046, 0.8765087723731995, 0.35308828949928284, -0.27713629603385925, 1.0122838020324707, 0.6830829977989197, 0.056731414049863815, -0.1988934427499771, 0.6757612228393555, -0.23377840220928192, 0.514396607875824, 0.35632020235061646, -0.30428650975227356, 0.4220661520957947, -0.08308613300323486, 0.5533400177955627, 0.6339097023010254, 0.2691302001476288, 0.06691533327102661, 0.4273039996623993, -0.2317819446325302, 0.8585823774337769, 0.05088811367750168, -0.083768829703331], [-0.018538102507591248, 0.6511807441711426, 0.5267317891120911, 0.684144914150238, 0.2705412209033966, 0.755435049533844, 0.3599887192249298, 0.43967148661613464, 0.3433612287044525, 0.7244818806648254, 0.4913097321987152, 0.04379597306251526, 0.48339444398880005, 0.36999404430389404, -0.0592292882502079, 0.14474767446517944, 0.7352150082588196, 0.1003323495388031, 0.30448397994041443, 0.3801066279411316, 0.09272366762161255, 0.2580111026763916, -0.08413752913475037, 0.5451464653015137, 0.38612794876098633, 0.29419949650764465, -0.08459405601024628, 0.5607261657714844, -1.064850091934204, 0.46766433119773865, -0.26589247584342957, -0.11019838601350784], [-0.2786138355731964, 0.06855305284261703, 0.18228048086166382, 0.07594672590494156, -0.06954112648963928, 0.164064422249794, 0.46460971236228943, 0.31951606273651123, 0.37804126739501953, 0.5091153383255005, 0.1795806586742401, 0.23720088601112366, 0.25930511951446533, 0.07432389259338379, 0.051214538514614105, -0.19907528162002563, 0.48217692971229553, -0.06873345375061035, 0.2879784107208252, 0.3371928930282593, -0.17519713938236237, 0.5536379814147949, -0.08843274414539337, 0.22972266376018524, 0.294973760843277, -0.2189759463071823, -0.023466002196073532, 0.43721601366996765, -0.1749059408903122, 0.17195382714271545, 0.21081142127513885, 0.27930405735969543], [0.18112361431121826, 0.46953892707824707, 0.2873731255531311, 0.37191396951675415, -0.15189698338508606, 0.4893243610858917, 0.4821945130825043, 0.16737081110477448, 0.11870576441287994, 0.6070913076400757, 0.4017157554626465, -0.11906896531581879, 0.4867623448371887, 0.14771784842014313, -0.015138480812311172, 0.2548721730709076, 0.6447799205780029, -0.1248706728219986, 0.595761239528656, 0.11744878441095352, -0.21816162765026093, 0.2161809802055359, 0.03862236067652702, 0.0043561216443777084, 0.6585798263549805, -0.1660732477903366, 0.1649332046508789, 0.6124129295349121, -0.48415637016296387, 0.27512162923812866, -0.2247106283903122, 0.07776747643947601], [0.07834199070930481, 0.22676575183868408, 0.10342428833246231, -0.10643449425697327, -0.018517449498176575, 0.24892482161521912, -0.06541991978883743, 0.18182004988193512, -0.14510318636894226, -0.1938287764787674, -0.18058422207832336, -0.2885255515575409, 0.19200220704078674, -0.13622401654720306, -0.0671662837266922, 0.07958951592445374, 0.18309712409973145, -0.055774033069610596, 0.17747658491134644, -0.24471555650234222, -0.14124730229377747, 0.04509183019399643, -0.0466499924659729, -0.16321143507957458, 0.1413794308900833, 0.2779836356639862, 0.0024836789816617966, 0.1191004291176796, 0.24516163766384125, -0.007600801065564156, -0.14281849563121796, -0.26588305830955505], [-0.0199764221906662, 0.4707191288471222, 0.24541756510734558, 0.4749075770378113, -0.15293417870998383, 0.530633270740509, 0.10362187027931213, 0.4453905522823334, 0.5823057889938354, 0.24886971712112427, 0.5326698422431946, -0.011295460164546967, 0.2781391739845276, 0.1284753382205963, -0.26299187541007996, -0.2424761950969696, 0.42502909898757935, 0.13646525144577026, 0.55967777967453, 0.30273088812828064, 0.2086808979511261, 0.5912577509880066, -0.2947840988636017, 0.40156012773513794, 0.44098925590515137, -0.1147453635931015, -0.03236779943108559, 0.5884793996810913, -0.2521320879459381, 0.3855248689651489, -0.13954396545886993, -0.15757101774215698], [-0.20519520342350006, 0.635752260684967, 0.7600893974304199, 0.14730781316757202, -0.20380520820617676, 0.43903565406799316, 0.4495297968387604, 0.5746071934700012, 0.6847853064537048, 0.09457603842020035, 0.14404821395874023, 0.15992432832717896, 0.2861063480377197, 0.43598031997680664, 0.26066040992736816, -0.1960105001926422, 0.7111482620239258, 0.22057822346687317, 0.317920058965683, 0.2789490818977356, -0.3041037917137146, 0.2825443148612976, 0.20735985040664673, 0.09661511331796646, 0.6616206765174866, -0.1061394065618515, -0.05998943746089935, 0.2879936397075653, -0.17608627676963806, 0.3120075464248657, -0.2785598337650299, 0.22810354828834534], [-0.12392692267894745, -0.11144194006919861, 0.20804207026958466, 0.159803107380867, 0.10975825786590576, -0.22268322110176086, 0.05438968911767006, 0.08329632133245468, -0.2313579022884369, 0.19890697300434113, 0.13152118027210236, -0.2217612862586975, 0.11034142971038818, -0.03229265287518501, 0.2790338099002838, 0.24883046746253967, 0.26538118720054626, -0.10211080312728882, -0.11650107055902481, -0.022140849381685257, -0.06450752913951874, 0.18716809153556824, -0.16836655139923096, -0.19973760843276978, -0.04781349003314972, 0.2780362665653229, -0.02427235245704651, -0.04869190230965614, 0.154412180185318, -0.11021436750888824, 0.22443708777427673, 0.19586142897605896], [0.27908942103385925, 0.01001963671296835, 0.24477563798427582, -0.08032118529081345, -0.03655710816383362, 0.02478335052728653, 0.20285122096538544, 0.026626253500580788, -0.2890990376472473, 0.16304327547550201, -0.08322840183973312, -0.1926676630973816, 0.2092876136302948, 0.024878323078155518, 0.14703062176704407, 0.1292438507080078, 0.28703364729881287, -0.29069024324417114, 0.19861795008182526, 0.24092191457748413, -0.1335488259792328, 0.09318171441555023, 0.12768039107322693, 0.02493242919445038, -0.08523768931627274, -0.2773962616920471, -0.21348623931407928, 0.12211591750383377, 0.14471566677093506, 0.2811308801174164, 0.12831571698188782, -0.1036284863948822], [0.30471310019493103, -0.19665855169296265, 0.27601027488708496, 0.16857679188251495, -0.11708948016166687, 0.119269460439682, -0.19715990126132965, 0.07521574944257736, -0.20625266432762146, 0.08431873470544815, -0.07168155163526535, -0.2819777727127075, -0.1091446578502655, -0.2501826584339142, 0.11057746410369873, -0.00541209802031517, -0.0009920774027705193, 0.011131368577480316, 0.08207830786705017, 0.03609631210565567, 0.08487355709075928, -0.2572730481624603, 0.08720499277114868, 0.1680012196302414, -0.020176978781819344, -0.0018632542341947556, 0.2661183178424835, -0.1604275107383728, -0.09649134427309036, 0.19030427932739258, -0.029342621564865112, 0.10717615485191345], [0.006162576377391815, -0.24637208878993988, -0.12253692001104355, 0.2756727337837219, -0.05242404341697693, -0.09063940495252609, 0.10079506784677505, 0.15720771253108978, 0.02815335988998413, 0.22742284834384918, -0.2355402410030365, 0.049396127462387085, 0.23310944437980652, -0.014684483408927917, -0.22688612341880798, 0.025264084339141846, 0.28425905108451843, 0.15123283863067627, 0.14781296253204346, 0.1481761634349823, -0.027144581079483032, -0.10926797240972519, -0.217329204082489, -0.09334798902273178, -0.056657642126083374, -0.05543467402458191, -0.21905303001403809, -0.055386994034051895, -0.19885653257369995, 0.03286352753639221, -0.2866365909576416, 0.25332412123680115], [0.1154845654964447, 0.5891048312187195, 0.7331610321998596, 0.7372408509254456, -0.025588124990463257, 0.6198093891143799, 0.2882744371891022, 0.6436955332756042, 0.3661559224128723, 0.47893327474594116, 0.5233440399169922, -0.2219807207584381, 0.3400849401950836, 0.5869010090827942, -0.23539170622825623, -0.2696039080619812, 0.31481045484542847, -0.019845768809318542, 0.288033127784729, 0.23842944204807281, -0.138043612241745, 0.5146236419677734, -0.20252873003482819, 0.5696507096290588, 0.778598964214325, -0.1637502908706665, -0.3014984726905823, 0.6568329334259033, -0.7030819654464722, 0.7646381855010986, 0.0707717016339302, 0.25310027599334717], [0.0313076376914978, -0.24355697631835938, 0.10160944610834122, 0.05754072219133377, -0.27973586320877075, 0.20841535925865173, -0.034460101276636124, 0.025752926245331764, -0.21785500645637512, -0.2735820710659027, 0.1666923612356186, 0.15777140855789185, 0.1638483703136444, -0.1202751100063324, 0.24777057766914368, -0.0008747195824980736, -0.2982273995876312, 0.08461353182792664, -0.1713293492794037, 0.00761252548545599, -0.058957889676094055, 0.010297683998942375, -0.13900050520896912, 0.14742521941661835, 0.08335704356431961, 0.29336580634117126, -0.031745344400405884, -0.27560266852378845, 0.24015997350215912, 0.058052852749824524, 0.09384414553642273, -0.10297279059886932], [-0.2294386625289917, 0.13125067949295044, 0.26446399092674255, 0.4769980311393738, -0.10622882843017578, 0.5577847361564636, 0.4975818395614624, 0.57774817943573, 0.42735618352890015, 0.4800807535648346, 0.4028756618499756, -0.07393714785575867, 0.009603465907275677, 0.2694481611251831, -0.3083346486091614, 0.05251947045326233, 0.28169843554496765, -0.035935431718826294, 0.5306025743484497, 0.23342932760715485, 0.21892938017845154, 0.11257456243038177, -0.005283231381326914, 0.5397858619689941, 0.19000093638896942, 0.033183544874191284, -0.11146299540996552, 0.07674937695264816, 0.049699652940034866, 0.40055152773857117, -0.23533225059509277, -0.14359770715236664]], [0.0, -0.04062434285879135, 0.010565027594566345, 0.013957815244793892, 0.0, 0.022687043994665146, 0.03675473853945732, -0.0644349604845047, 0.05422613024711609, 0.019136367365717888, 0.04409847781062126, 0.0, 0.07178708910942078, 0.03507367894053459, -0.023706750944256783, 0.0, 0.03553588688373566, 0.0, 0.044709306210279465, 0.02758977748453617, 0.0, 0.02633339911699295, -0.025998316705226898, 0.018474113196134567, 0.051483821123838425, 0.0, -0.015145138837397099, 0.0379728265106678, -0.12357806414365768, 0.006034073419868946, -0.02238289639353752, -0.017821282148361206], [[-0.0587620735168457, 0.01674579083919525, -0.10304956883192062, -0.1151532232761383, -0.04296982288360596, -0.13570314645767212, -0.22423964738845825, 0.15904870629310608, -0.06059449911117554, 0.17308443784713745, -0.3048217296600342, -0.29999881982803345, 0.12187275290489197, 0.046791914850473404, 0.24325837194919586, 0.03923403099179268, -0.15224526822566986, 0.07952013611793518, -0.057965464890003204, 0.06639888882637024, -0.06717328727245331, -0.1471787989139557, -0.29916325211524963, 0.16123929619789124, -0.052888739854097366, -0.2390652447938919, -0.29495105147361755, -0.2601637840270996, 0.09637840837240219, 0.08140590786933899, -0.037012845277786255, -0.007923655211925507], [0.24481624364852905, 0.3655793368816376, 0.13166476786136627, 0.5039664506912231, 0.3351436257362366, 0.5550290942192078, 0.04571223258972168, 0.12292501330375671, 0.5261558294296265, 0.31465351581573486, 0.1894734501838684, 0.4393298923969269, -0.19883985817432404, 0.33824414014816284, 0.5903212428092957, 0.5270996689796448, 0.31060948967933655, -0.1504606306552887, 0.45096755027770996, 0.5743275880813599, 0.13542215526103973, 0.17924247682094574, 0.4483240842819214, 0.32985642552375793, 0.468124657869339, 0.6528445482254028, 0.553677499294281, 0.34383442997932434, 0.4988750219345093, 0.560647189617157, 0.39659425616264343, 0.554924726486206], [0.6941966414451599, 0.22846277058124542, 0.6822671294212341, 0.3323006331920624, 0.3668898642063141, 0.6760477423667908, 0.2834583818912506, 0.5137463212013245, 0.18665023148059845, 0.2546287477016449, 0.39644578099250793, 0.5414486527442932, -0.14443320035934448, 0.638128936290741, 0.42423900961875916, 0.4663863182067871, 0.33867889642715454, 0.0916014313697815, 0.4123341143131256, 0.2036999613046646, 0.5972021818161011, 0.3889924883842468, 0.28664377331733704, 0.6882337331771851, 0.5854954719543457, 0.6810330152511597, 0.5915499925613403, 0.19613443315029144, 0.3529588282108307, 0.1993297040462494, 0.4104153513908386, 0.34991058707237244], [0.6486814618110657, 0.5131159424781799, 0.325918585062027, 0.3349079191684723, 0.3943573236465454, 0.13690832257270813, -0.25435468554496765, 0.07312514632940292, 0.4981578290462494, 0.11561212688684464, 0.23333705961704254, 0.16145165264606476, -0.10411874949932098, 0.2948877811431885, 0.5258520841598511, 0.5792233943939209, 0.6537561416625977, 0.23128733038902283, 0.22599239647388458, 0.7127554416656494, 0.19747962057590485, 0.5534062385559082, 0.7006328105926514, 0.29502585530281067, 0.2750489413738251, 0.12405671179294586, 0.1285376399755478, 0.1453978717327118, 0.554009735584259, 0.29854536056518555, 0.6410864591598511, 0.35848161578178406], [-0.28808578848838806, 0.2578936517238617, -0.24456776678562164, -0.2490437626838684, 0.2811509668827057, 0.1279534101486206, -0.25386908650398254, -0.29849639534950256, 0.03402295708656311, -0.1516336053609848, 0.11264258623123169, 0.12241072952747345, 0.1858949065208435, -0.24271170794963837, -0.17629754543304443, -0.15086816251277924, -0.27527397871017456, 0.16748887300491333, -0.25319331884384155, 0.19416697323322296, -0.18187689781188965, -0.10388968139886856, -0.06593717634677887, -0.05791874974966049, 0.2095186561346054, -0.04076104983687401, -0.03622114658355713, -0.0854739248752594, 0.04408328980207443, -0.11299633979797363, -0.03990104794502258, 0.1598365306854248], [0.34213635325431824, 0.5161205530166626, 0.42940521240234375, 0.3373153805732727, 0.5076613426208496, 0.34930428862571716, -0.11570115387439728, 0.4596431255340576, 0.5853652358055115, 0.6295833587646484, 0.465559720993042, 0.22587428987026215, 0.08714491128921509, 0.23125888407230377, 0.47451382875442505, 0.10276481509208679, 0.34024423360824585, -0.2613086402416229, 0.36432120203971863, 0.5653784871101379, 0.6714031100273132, 0.3686392903327942, 0.18594202399253845, 0.20682460069656372, 0.231760635972023, 0.23777370154857635, 0.17612174153327942, 0.6087976694107056, 0.37363895773887634, 0.5774886608123779, 0.2675244212150574, 0.5198249816894531], [0.1840481162071228, 0.36984699964523315, 0.2965835928916931, 0.24424611032009125, 0.11157576739788055, 0.3184353709220886, -0.27935969829559326, 0.31029385328292847, 0.13133259117603302, 0.31694087386131287, 0.2384127974510193, 0.5118787884712219, -0.08711409568786621, -0.0032608206383883953, 0.427375465631485, 0.14722631871700287, 0.2814706861972809, -0.030453890562057495, 0.210697740316391, 0.3363143801689148, 0.4356950521469116, 0.3194485604763031, 0.4346919357776642, 0.17579619586467743, 0.32292476296424866, 0.08413806557655334, 0.4875401556491852, 0.4945911467075348, 0.581508457660675, 0.24269410967826843, 0.27168145775794983, 0.28324437141418457], [0.7145320177078247, 0.5606483221054077, 0.7438044548034668, 0.4218614399433136, 0.47084710001945496, 0.637782633304596, -0.23699618875980377, 0.6092253923416138, 0.42368224263191223, 0.30046650767326355, 0.43237969279289246, 0.288765549659729, -0.0733853429555893, 0.21443867683410645, 0.4950913190841675, 0.629361093044281, 0.6883442997932434, 0.08942368626594543, 0.4011603891849518, 0.4062720239162445, 0.2227737158536911, 0.554343044757843, 0.5007369518280029, 0.1867716908454895, 0.3834418058395386, 0.6709421873092651, 0.7046773433685303, 0.2705546021461487, 0.3550337255001068, 0.23220676183700562, 0.37808796763420105, 0.6337609887123108], [0.5035258531570435, 0.10939643532037735, 0.2598550021648407, 0.2459181547164917, 0.43094053864479065, 0.4799429476261139, 0.08200305700302124, 0.5024693608283997, 0.5973203182220459, 0.3016666769981384, 0.380672425031662, 0.45574966073036194, 0.17746248841285706, 0.5284615159034729, 0.47855332493782043, 0.4760030210018158, 0.38684970140457153, -0.20696422457695007, 0.3684989809989929, 0.27428874373435974, 0.19840900599956512, 0.3131720721721649, 0.4915938675403595, 0.1314798891544342, 0.5626291632652283, 0.5658509135246277, 0.4168805181980133, 0.4679339528083801, 0.08940450102090836, 0.49376100301742554, 0.2666977643966675, 0.3206607401371002], [0.5295957922935486, 0.10705766081809998, 0.42921027541160583, 0.46821528673171997, 0.49443063139915466, 0.15674754977226257, -0.20861652493476868, 0.527774453163147, 0.40326300263404846, 0.5525676012039185, 0.1160285696387291, 0.2685468792915344, -0.21439428627490997, 0.25017115473747253, 0.6182424426078796, 0.1401197612285614, 0.4116054177284241, -0.13228431344032288, 0.1890994906425476, 0.4793683886528015, 0.426027774810791, 0.301098108291626, 0.285502552986145, 0.5445817112922668, 0.23906241357326508, 0.5239532589912415, 0.48152396082878113, 0.3648623526096344, 0.22688110172748566, 